## Import des librairies ##

In [317]:
#Imports librairies de base
import numpy as np
import pandas as pd

#Bibliothèques pour Cross validation

#Affichage de Graphes
from IPython.display import Markdown, display, HTML

## 1. Lecture des données ##

1.1 Charger les données d'apprentissage (Data/passagers.csv) dans un DataFrame nommé train. Afficher 10 exemples.

In [318]:
train = pd.read_csv('Data/passagers.csv', dtype={'PassengerId': np.int})
train.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
800,801,0,2,"Ponesell, Mr. Martin",male,34.0,0,0,250647,13.0000,NaN,S
86,87,0,3,"Ford, Mr. William Neal",male,16.0,1,3,W./C. 6608,34.3750,NaN,S
344,345,0,2,"Fox, Mr. Stanley Hubert",male,36.0,0,0,229236,13.0000,NaN,S
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.3500,NaN,S
290,291,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0,0,0,19877,78.8500,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
536,537,0,1,"Butt, Major. Archibald Willingham",male,45.0,0,0,113050,26.5500,B38,S
122,123,0,2,"Nasser, Mr. Nicholas",male,32.5,1,0,237736,30.0708,NaN,C
811,812,0,3,"Lester, Mr. James",male,39.0,0,0,A/4 48871,24.1500,NaN,S

1.2 Charger les données d'apprentissage (Data/test.csv) dans un Dataframe nommé test. Afficher 10 exemples.

In [319]:
test = pd.read_csv('Data/test.csv', dtype={'PassengerId': np.int})
test.sample(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
49,941,3,"Coutts, Mrs. William (Winnie Minnie"" Treanor)""",female,36.0,0,2,C.A. 37671,15.9000,NaN,S
194,1086,2,"Drew, Master. Marshall Brines",male,8.0,0,2,28220,32.5000,NaN,S
162,1054,2,"Wright, Miss. Marion",female,26.0,0,0,220844,13.5000,NaN,S
59,951,1,"Chaudanson, Miss. Victorine",female,36.0,0,0,PC 17608,262.3750,B61,C
241,1133,2,"Christy, Mrs. (Alice Frances)",female,45.0,0,2,237789,30.0000,NaN,S
408,1300,3,"Riordan, Miss. Johanna Hannah""""",female,NaN,0,0,334915,7.7208,NaN,Q
379,1271,3,"Asplund, Master. Carl Edgar",male,5.0,4,2,347077,31.3875,NaN,S
225,1117,3,"Moubarek, Mrs. George (Omine Amenia"" Alexander)""",female,NaN,0,2,2661,15.2458,NaN,C
291,1183,3,"Daly, Miss. Margaret Marcella Maggie""""",female,30.0,0,0,382650,6.9500,NaN,Q
386,1278,3,"Aronsson, Mr. Ernst Axel Algot",male,24.0,0,0,349911,7.7750,NaN,S

1.3 Afficher les informations des deux DataFrames train et Test.

In [320]:
train.info()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

1.4 Calculer le taux global de survie

In [321]:
survived = train['Survived'].mean()
survived

0.3838383838383838

#### Question 1 : Quel Travail voyez-vous pour que les données soient prêtes à faire tourner dans un modèle ?



#### Question 2 : Quelle différence y-a-t'il entre les données train et les données test ? 

Il y a une colonne en plus dans train, la colonne survived.


#### Question 3 : Quel est le rôle de ces deux sets de données ?

## 2. Analyse des features

2.1 Analyser l'effet de la variable Classe sur le taux de survie, en affichant le % de survie par classe

In [322]:
survived_by_group = train[['Survived','Pclass']].groupby(['Pclass']).mean() *100
survived_by_group

         Survived
Pclass
1       62.962963
2       47.282609
3       24.236253

2.2 Analyser l'effet de la variable Genre (Sex) sur le taux de survie, en affichant le % de survie par genre

In [323]:
survived_by_sex = train[['Survived','Sex','Pclass']].groupby(['Sex', 'Pclass']).mean() *100
survived_by_sex

                Survived
Sex    Pclass
female 1       96.808511
       2       92.105263
       3       50.000000
male   1       36.885246
       2       15.740741
       3       13.544669

2.3 Calculer une nouvelle colonne FamilySize contenant la taille de la famille, pour les DataFrame train et Test. Afficher pour 10 exemples l'Id du passager, le nom, l'age, le sexe et la taille de la famille.

In [324]:
train['FamilySize'] = train['SibSp'] + train['Parch'] + 1
train[['PassengerId','Name','Age','FamilySize']].head(10)

test['FamilySize'] = test['SibSp'] + test['Parch'] + 1
test[['PassengerId','Name','Age','FamilySize']].head(10)

   PassengerId                                          Name   Age  FamilySize
0          892                              Kelly, Mr. James  34.5           1
1          893              Wilkes, Mrs. James (Ellen Needs)  47.0           2
2          894                     Myles, Mr. Thomas Francis  62.0           1
3          895                              Wirz, Mr. Albert  27.0           1
4          896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0           3
5          897                    Svensson, Mr. Johan Cervin  14.0           1
6          898                          Connolly, Miss. Kate  30.0           1
7          899                  Caldwell, Mr. Albert Francis  26.0           3
8          900     Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.0           1
9          901                       Davies, Mr. John Samuel  21.0           3

2.4 Visualisez le nombre de personnes et le taux de survie par taille de famille.

In [325]:
frames = [train[['FamilySize', 'Survived']].groupby(['FamilySize']).mean(), train[['Survived', 'FamilySize']].groupby('FamilySize').count()]
pd.concat(frames, axis=1, sort=False)

            Survived  Survived
FamilySize
1           0.303538       537
2           0.552795       161
3           0.578431       102
4           0.724138        29
5           0.200000        15
6           0.136364        22
7           0.333333        12
8           0.000000         6
11          0.000000         7

2.5 Calculer une nouvelle colonne IsAlone indiquant si le passager est seul ou pas, pour les DataFrame train et Test. Afficher pour 10 exemples l'Id du passager, le nom, l'age, le sexe et le status IsAlone.

In [326]:
train['IsAlone'] = train.FamilySize.map(lambda x: x == 1)
train[['PassengerId','Name','Age','IsAlone']].head(10)
test['IsAlone'] = test.FamilySize.map(lambda x: x == 1)
test[['PassengerId','Name','Age','IsAlone']].head(10)

   PassengerId                                          Name   Age  IsAlone
0          892                              Kelly, Mr. James  34.5     True
1          893              Wilkes, Mrs. James (Ellen Needs)  47.0    False
2          894                     Myles, Mr. Thomas Francis  62.0     True
3          895                              Wirz, Mr. Albert  27.0     True
4          896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0    False
5          897                    Svensson, Mr. Johan Cervin  14.0     True
6          898                          Connolly, Miss. Kate  30.0     True
7          899                  Caldwell, Mr. Albert Francis  26.0    False
8          900     Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.0     True
9          901                       Davies, Mr. John Samuel  21.0    False

2.6 Visualisez le nombre de personnes et le taux de survie par statut seul ou pas.

In [327]:
frames = [train[['IsAlone', 'Survived']].groupby(['IsAlone']).mean(), train[['IsAlone', 'Survived']].groupby('IsAlone').count()]
pd.concat(frames, axis=1, sort=False)

         Survived  Survived
IsAlone
False    0.505650       354
True     0.303538       537

### Question 1 : La variable Classe est-elle utile pour prévoir la survie ? Pourquoi ?



### Question 2 : Même question pour la variable Sex 


### Question 3 : Comment traiter le variables liées à la famille du passager ?

## 3. Traitement des données manquantes (à faire sur les données Train et Test)

3.1 La variable "Embarked" possède des valeurs nulles, compléter par la valeur majoritaire (S).

In [328]:
train['Embarked'].fillna('S', inplace=True)
train.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,IsAlone
705,706,0,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.0000,NaN,S,1,True
805,806,0,3,"Johansson, Mr. Karl Johan",male,31.0,0,0,347063,7.7750,NaN,S,1,True
621,622,1,1,"Kimball, Mr. Edwin Nelson Jr",male,42.0,1,0,11753,52.5542,D19,S,2,False
81,82,1,3,"Sheerlinck, Mr. Jan Baptist",male,29.0,0,0,345779,9.5000,NaN,S,1,True
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,7,False
837,838,0,3,"Sirota, Mr. Maurice",male,NaN,0,0,392092,8.0500,NaN,S,1,True
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0000,NaN,S,1,True
398,399,0,2,"Pain, Dr. Alfred",male,23.0,0,0,244278,10.5000,NaN,S,1,True
274,275,1,3,"Healy, Miss. Hanora ""Nora""",female,NaN,0,0,370375,7.7500,NaN,Q,1,True
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,1,True

3.2 Afficher l'influence du port d'embarquement sur la Survie

In [329]:
train[['Embarked','Survived']].groupby(['Embarked']).mean() * 100

           Survived
Embarked
C         55.357143
Q         38.961039
S         33.900929

3.3 La variable "Fare" (prix du ticket) possède des valeurs manquantes. Remplacer ces valeurs par la valeur médiane.

In [330]:
train.Fare.fillna(train.Fare.median(), inplace=True)

3.4 Créer une variable CategoricalFare Découpant la valeur de ticket en 4 catégories de tailles à peu près égales.

In [331]:
train['CategoricalFare'] = pd.qcut(train['Fare'], 4)

3.5 Analyser l'effet de ces catégories de prix de ticket sur la survie.

In [332]:
train[['CategoricalFare', 'Survived']].groupby(['CategoricalFare']).mean()

                 Survived
CategoricalFare
(-0.001, 7.91]   0.197309
(7.91, 14.454]   0.303571
(14.454, 31.0]   0.454955
(31.0, 512.329]  0.581081

3.6 Combien de valeurs d'Age manquent ? Complète par des valeurs entières aléatoires entre (moyenne - écart type) et (moyenne + écart type).

In [333]:
train.loc[train.Age.isna()].PassengerId.count()
train.Age.fillna(np.random.randint(train.Age.mean() - train.Age.std(), train.Age.mean() + train.Age.std()), inplace=True)

3.7 Créer une variable CategoricalAge Découpant la valeur d'age en 5 catégories égales.

In [334]:
train['CategoricalAge'] = pd.qcut(train.Age, 5)
train.CategoricalAge

0       (20.0, 28.0]
1       (35.0, 38.0]
2       (20.0, 28.0]
3       (28.0, 35.0]
4       (28.0, 35.0]
           ...
886     (20.0, 28.0]
887    (0.419, 20.0]
888     (28.0, 35.0]
889     (20.0, 28.0]
890     (28.0, 35.0]
Name: CategoricalAge, Length: 891, dtype: category
Categories (5, interval[float64]): [(0.419, 20.0] < (20.0, 28.0] < (28.0, 35.0] < (35.0, 38.0] < (38.0, 80.0]]

3.8 Analyser l'effet de ces catégories d'age sur la survie.

In [335]:
train[['CategoricalAge', 'Survived']].groupby(['CategoricalAge']).mean()

                Survived
CategoricalAge
(0.419, 20.0]   0.458101
(20.0, 28.0]    0.360656
(28.0, 35.0]    0.355769
(35.0, 38.0]    0.425000
(38.0, 80.0]    0.372881

### Question 1 : Classer les variables par ordre d'intérêt

Le sexe, age, la catégorie socio-économique, embarquement

## 4 : Traitement de features complexes (Optionnel)

4.1 : Le nom permet de retrouver le titre du passager. Trouver les titres lorsqu'ils existent.

In [336]:
train['Title'] = train.Name.map(lambda x: x.split(', ')[1].split('.')[0])

4.2 : En utilisant la fonction pandas crosstab, afficher pour train le nombre d'occurences par titres (en ligne) et par sexe (en colonne)

In [337]:
pd.crosstab(train.Title.values, [train.Sex.values])

col_0         female  male
row_0
Capt               0     1
Col                0     2
Don                0     1
Dr                 1     6
Jonkheer           0     1
Lady               1     0
Major              0     2
Master             0    40
Miss             182     0
Mlle               2     0
Mme                1     0
Mr                 0   517
Mrs              125     0
Ms                 1     0
Rev                0     6
Sir                0     1
the Countess       1     0

4.3 : 
Remplacer 'Melle et 'Ms' par 'Miss'
Remplacer 'Mme' par 'Mrs'
Creer une valeur "Rare" pour les autres titres avec moins de 10 occurences.

In [338]:
train.Title.replace(to_replace = ["Ms", "Mlle"], value ="Miss")
train.Title.replace(to_replace = "Mme", value ="Mrs")
train.loc[train.groupby('Title').Title.transform('count').lt(10), 'Title'] = 'Rare'
train.Title.value_counts()

Mr        517
Miss      182
Mrs       125
Master     40
Rare       27
Name: Title, dtype: int64

## 5. Mise en forme des données non numériques

5.1 Attribuer une valeur numérique au Genre. Par exemple 0 pour 'female' et 1 pour 'male'

In [339]:
train.Sex.map(
    {
     'female': 0,
     'male': 1,
    }
)

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 891, dtype: int64

5.2 : Attribuer une valeur pour les possibilités de la variable "Title" ('Master','Miss','Mr','Mrs','Rare').

In [340]:
train.Title.map(
    {
     'Master': 1,
     'Miss': 2,
     'Mr': 3,
     'Mrs': 4,
     'Rare': 5,
    }
)

0      3
1      4
2      2
3      4
4      3
      ..
886    5
887    2
888    2
889    3
890    3
Name: Title, Length: 891, dtype: int64

5.3 Remplacer les titres manquant par 0, et attribuer à la colonne le type entier.

In [341]:
  # pas besoins car titre déjà remplacé dans le dans 4.3

5.4 Attribuer une valeur numérique aux 4 catégories de la variable Fare (question 3.4)

In [342]:
unique = train.CategoricalFare.unique()
train.CategoricalFare.map(
    {
        unique[0]: 0,
        unique[1]: 1,
        unique[2]: 2,
        unique[3]: 3
    }
)

0      0
1      1
2      2
3      1
4      2
      ..
886    2
887    3
888    3
889    3
890    0
Name: CategoricalFare, Length: 891, dtype: category
Categories (4, int64): [0 < 2 < 3 < 1]

5.5 Attribuer une valeur numérique aux 5 catégories de la variable Age (question 3.7)

In [343]:
unique = train.CategoricalAge.unique()
train.CategoricalAge.map(
    {
        unique[0]: 0,
        unique[1]: 1,
        unique[2]: 2,
        unique[3]: 3,
        unique[4]: 4
    }
)

0      0
1      1
2      0
3      2
4      2
      ..
886    0
887    4
888    2
889    0
890    2
Name: CategoricalAge, Length: 891, dtype: category
Categories (5, int64): [4 < 0 < 2 < 1 < 3]

5.6 Attibuer une valeur numérique au Port d'embarquement (Embarked)

In [344]:
unique = train.Embarked.unique()
train.Embarked.map(
    {
        unique[0]: 0,
        unique[1]: 1,
        unique[2]: 2
    }
)

0      0
1      1
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    1
890    2
Name: Embarked, Length: 891, dtype: int64

5.7 Supprimer les features inutiles

In [345]:
drop_col = ['Name','Age','SibSp','Parch','Ticket','Cabin','Fare']
train.drop(drop_col, axis=1)

,PassengerId,Survived,Pclass,Sex,Embarked,FamilySize,IsAlone,CategoricalFare,CategoricalAge,Title
0,1,0,3,male,S,2,False,"(-0.001, 7.91]","(20.0, 28.0]",Mr
1,2,1,1,female,C,2,False,"(31.0, 512.329]","(35.0, 38.0]",Mrs
2,3,1,3,female,S,1,True,"(7.91, 14.454]","(20.0, 28.0]",Miss
3,4,1,1,female,S,2,False,"(31.0, 512.329]","(28.0, 35.0]",Mrs
4,5,0,3,male,S,1,True,"(7.91, 14.454]","(28.0, 35.0]",Mr
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,S,1,True,"(7.91, 14.454]","(20.0, 28.0]",Rare
887,888,1,1,female,S,1,True,"(14.454, 31.0]","(0.419, 20.0]",Miss
888,889,0,3,female,S,4,False,"(14.454, 31.0]","(28.0, 35.0]",Miss
889,890,1,1,male,C,1,True,"(14.454, 31.0]","(20.0, 28.0]",Mr
890,891,0,3,male,Q,1,True,"(-0.001, 7.91]","(28.0, 35.0]",Mr

5.8 Afficher les infos pour les deux datasets

In [346]:
train.info()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PassengerId      891 non-null    int64
 1   Survived         891 non-null    int64
 2   Pclass           891 non-null    int64
 3   Name             891 non-null    object
 4   Sex              891 non-null    object
 5   Age              891 non-null    float64
 6   SibSp            891 non-null    int64
 7   Parch            891 non-null    int64
 8   Ticket           891 non-null    object
 9   Fare             891 non-null    float64
 10  Cabin            204 non-null    object
 11  Embarked         891 non-null    object
 12  FamilySize       891 non-null    int64
 13  IsAlone          891 non-null    bool
 14  CategoricalFare  891 non-null    category
 15  CategoricalAge   891 non-null    category
 16  Title            891 non-null    object
dtypes: bool(1), category(2), float64(2), int64(6), object(6)
memory usage: 100.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
 11  FamilySize   418 non-null    int64
 12  IsAlone      418 non-null    bool
dtypes: bool(1), float64(2), int64(5), object(5)
memory usage: 39.7+ KB

# Sauver les deux datasets dans des fichier csv. Eviter d'écrire un index (n° de ligne)

In [347]:
train.to_csv('Data/passagers_after.csv', index=False)
test.to_csv('Data/test_after.csv', index=False)

##### Question : Sur combien de questions avez-vous utilisé les conseils ?

0